# ---------------------------------------------------------------------------------------
# ---{ Brewfile } -----------------------------------------------------------------------
# ---------------------------------------------------------------------------------------
#
#   This file lists some of the programs that I use on mac OSX
#
#   `brew bundle cleanup`               Will tell you how out of sync this file is
#   `brew bundle cleanup --force`       Remove stuff that are not in this file
#   `brew bundle`                       Install everything listed in this file
#
# ---{ Taps } ---------------------------------------------------------------------------
#
#   These are the packages reposititories that homebrew should look at
#

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"


# ---{ Programs } -----------------------------------------------------------------------

# Version Control
brew "diff-so-fancy"
brew "git"
brew "hub"
brew "subversion"

# Node related
brew "nodenv"
# brew "npm"
brew "nvm"
# brew "yarn"

# Haskell Related
brew "cabal-install"
brew "ghc"

# Other programs
brew "aria2"
brew "bat"
brew "cmake"
brew "direnv"
brew "go"
brew "highlight"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "libpng"
brew "lua"
brew "maven"
brew "mitmproxy"
brew "neovim"
brew "pandoc"
brew "proxychains-ng"
brew "python"
brew "redis"
brew "ripgrep"
brew "sops"
brew "terraform"
brew "tree"
brew "wabt"
brew "wget"
brew "zsh"


# ---{ Casks } --------------------------------------------------------------------------
#
#   `brew cask` is an extension to `brew` that allows for the management of graphical
#   applications through the cask project
#

cask_args appdir: "/Applications"
cask_args fontdir: "/Library/Fonts"

# Fonts
cask "font-fira-code"
cask "font-firacode-nerd-font"
cask "font-iosevka"
cask "font-raleway"

# Quicklook
cask "qlcolorcode"
cask "qlmarkdown"
cask "quicklook-json"

# android
cask "android-sdk"
cask "android-platform-tools"

cask "alfred"
cask "appcleaner"
cask "atom"
cask "beardedspice"
cask "boostnote"
cask "caffeine"
cask "charles"
cask "cyberduck"
cask "docker"
cask "dozer"
cask "figma"
cask "flux"
cask "flycut"
cask "google-chrome"
cask "insomnia"
cask "intellij-idea"
cask "iterm2"
cask "itsycal"
cask "java"
cask "minikube"
cask "notion"
cask "pycharm"
cask "react-native-debugger"
cask "skype"
cask "spectacle"
cask "spotify"
cask "ubersicht"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"

# ---------------------------------------------------------------------------------------
