# ---------------------------------------------------------------------------------------
# ---{ Brewfile } -----------------------------------------------------------------------
# ---------------------------------------------------------------------------------------
#
#   This file lists some of the programs that I use on mac OSX
#
#   `brew bundle cleanup`               Will tell you how out of sync this file is
#   `brew bundle cleanup --force`       Remove stuff that are not in this file
#   `brew bundle`                       Install everything listed in this file
#
# ---{ Taps } ---------------------------------------------------------------------------
#
#   These are the packages reposititories that homebrew should look at
#

cask_args appdir: '/Applications'
cask_args fontdir: '/Library/Fonts'

tap 'aws/tap'
tap 'ngrok/ngrok'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

brew 'coreutils'
brew 'fd'

brew 'asdf'
brew 'adr-tools'
brew 'aria2'
brew 'automake'
brew 'bat'
brew 'bottom'
brew 'cmake'
brew 'dasel'
brew 'direnv'
brew 'diff-so-fancy'
brew 'elixir'
brew 'fzf'
brew 'gcc'
brew 'gnu-getopt'
brew 'gh'
brew 'go'
brew 'git'
brew 'gnutls'
brew 'grep'
brew 'gnupg'
brew 'tree'
brew 'helm@2'
brew 'hopenpgp-tools'
brew 'hugo'
brew 'jq'
brew 'julia'
brew 'k9s'
brew 'kubectx'
brew 'libusb'
brew 'libyubikey'
brew 'luajit'
brew 'mitmproxy'
brew 'nmap'
brew 'neovim', args: ["HEAD"]
brew 'node@12'
brew 'nodenv'
brew 'pinentry-mac'
brew 'postgresql'
brew 'protobuf'
brew 'pulumi'
brew 'redis'
brew 'rga'
brew 'ripgrep'
brew 'rust'
brew 'rustup'
brew 'shellcheck'
brew 'shfmt'
brew 'sheldon'
brew 'sops'
brew 'syncthing'
brew 'tfenv'
brew 'tree'
brew 'vifm'
brew 'yadm'
brew 'yarn'
brew 'ykman'
brew 'ykpers'
brew 'zplug'

brew 'afl-fuzz'
brew 'fastlane'
brew 'libssh'
brew 'neofetch'
brew 'node'
brew 'nvm'
brew 'lua'
brew 'terraform'
brew 'deno'
brew 'csvkit'
brew 'carthage'
brew 'aspell'
brew 'grpcurl'
brew 'qemu'
brew 'mysql'
brew 'exa'
brew 'wget'
brew 'k6'

cask 'font-cascadia-code'
cask 'font-hack'
cask 'font-iosevka'
cask 'font-jetbrains-mono'
cask 'font-hack-nerd-font'

# ---{ Casks } --------------------------------------------------------------------------
#
#   `brew cask` is an extension to `brew` that allows for the management of graphical
#   applications through the cask project
#

cask 'agenda'
cask 'alfred'
cask 'appcleaner'
cask 'beardedspice'
cask 'bloomrpc'
cask 'brave-browser'
cask 'burp-suite'
cask 'caffeine'
cask 'charles'
cask 'cyberduck'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'flycut'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'inkscape'
cask 'insomnia'
cask 'itsycal'
cask 'hiddenbar'
cask 'hyperswitch'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keybase'
cask 'kite'
cask 'kitty'
cask 'meetingbar'
cask 'ngrok'
cask 'obsidian'
cask 'postman'
cask 'rectangle'
cask 'spotify'
cask 'sublime-merge'
cask 'sublime-text'
cask 'tableplus'
cask 'ubersicht'
cask 'visual-studio-code'
cask 'wireshark'
cask 'xquartz'

# ---------------------------------------------------------------------------------------
