#---------------------------------------------------------------------------------------
# ---{ Brewfile } -----------------------------------------------------------------------
# ---------------------------------------------------------------------------------------
#
#   This file lists some of the programs that I use on mac OSX
#
#   `brew bundle cleanup`               Will tell you how out of sync this file is
#   `brew bundle cleanup --force`       Remove stuff that are not in this file
#   `brew bundle`                       Install everything listed in this file
#
# ---{ Taps } ---------------------------------------------------------------------------
#
#   These are the packages reposititories that homebrew should look at
#

cask_args appdir: '/Applications'
cask_args fontdir: '/Library/Fonts'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

tap 'pulumi/tap'
tap 'koekeishiya/formulae'

# ---{ Brews } --------------------------------------------------------------------------

brew 'aria2'
brew 'asdf'
brew 'carthage'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gitui'
brew 'gnupg'
brew 'go'
brew 'grep'
brew 'helix'
brew 'hopenpgp-tools'
brew 'ical-buddy'
brew 'jq'
brew 'kubectx'
brew 'make'
brew 'mitmproxy'
brew 'mprocs'
brew 'neofetch'
brew 'nmap'
brew 'pinentry-mac'
brew 'pnpm'
brew 'ppsspp'
brew 'proxychains-ng'
brew 'pulumi'
brew 'rtx'
brew 'ripgrep'
brew 'shellcheck'
brew 'shfmt'
brew 'spotify-tui'
brew 'spotifyd'  
brew 'syncthing'
brew 'tailscale'
brew 'tldr'
brew 'tree-sitter'
brew 'tree'
brew 'trash'
brew 'wget'
brew 'ykman'
brew 'yubikey-personalization'
brew 'zellij'
brew 'zoxide'

brew 'ant'
brew 'maven'
brew 'gradle'

# For RTL-SDR
brew 'airspy'
brew 'airspyhf'
brew 'cmake'
brew 'codec2'
brew 'fftw'
brew 'glfw'
brew 'hackrf'
brew 'libbladerf'
brew 'librtlsdr'
brew 'portaudio'
brew 'rtl-sdr'
brew 'soapyrtlsdr'
brew 'volk'
brew 'zstd'
brew 'urh'

brew 'yabai'
brew 'skhd'

# Neovim
# brew 'tree-sitter', args: ['HEAD']
# brew 'luajit', args: ['HEAD']
# brew 'neovim', args: ['HEAD']
# brew 'luajit-openresty', args: ['HEAD']

# ---{ Casks } --------------------------------------------------------------------------
#
#   `brew cask` is an extension to `brew` that allows for the management of graphical
#   applications through the cask project
#

cask 'font-iosevka'
cask 'font-hack'
cask 'font-jetbrains-mono'

cask 'brave-browser'

cask 'alacritty'
cask 'appcleaner'
cask 'beardedspice'
cask 'blender'
cask 'burp-suite'
cask 'caffeine'
cask 'calibre'
cask 'charles'
cask 'cyberduck'
cask 'discord'
cask 'dropbox'
cask 'element'
cask 'epic-games'
cask 'firefox'
cask 'gpg-suite-no-mail'
cask 'hammerspoon'
cask 'hiddenbar'
cask 'hyperswitch'
cask 'inkscape'
cask 'insomnia'
cask 'itsycal'
cask 'jetbrains-toolbox'
cask 'julia'
cask 'karabiner-elements'
cask 'keka'
cask 'monitorcontrol'
cask 'obsidian'
cask 'openemu'
cask 'rancher'
cask 'raycast'
cask 'react-native-debugger'
cask 'signal'
cask 'skim'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tailscale'
cask 'transmission'
cask 'twitch'
cask 'ubersicht'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'webex'
cask 'wireshark'
cask 'xquartz'
cask 'zoom'

cask 'gqrx'
cask 'cubicsdr'

cask 'android-sdk'
cask 'temurin'

cask 'balenaetcher'
cask 'barrier'

# ---------------------------------------------------------------------------------------

# Other programs
# ---------------------------------------------------------------------------------------
# - 1password
# - keybase
# - yubico authenticator
# cask '1password-cli'

# ---------------------------------------------------------------------------------------
