#---------------------------------------------------------------------------------------
# ---{ Brewfile } -----------------------------------------------------------------------
# ---------------------------------------------------------------------------------------
#
#   This file lists some of the programs that I use on mac OSX
#
#   `brew bundle cleanup`               Will tell you how out of sync this file is
#   `brew bundle cleanup --force`       Remove stuff that are not in this file
#   `brew bundle`                       Install everything listed in this file
#
# ---{ Taps } ---------------------------------------------------------------------------
#
#   These are the packages reposititories that homebrew should look at
#

cask_args appdir: '/Applications'
cask_args fontdir: '/Library/Fonts'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'
tap 'homebrew/services'

tap 'koekeishiya/formulae'

# ---{ Brews } --------------------------------------------------------------------------

brew 'airspy'
brew 'airspyhf'
brew 'codec2'
brew 'coreutils'
brew 'fftw'
brew 'gh'
brew 'glfw'
brew 'gnu-sed'
brew 'gnupg'
brew 'grep'
brew 'hackrf'
brew 'hledger'
brew 'hopenpgp-tools'
brew 'ical-buddy'
brew 'kubectx'
brew 'libbladerf'
brew 'librtlsdr'
brew 'lua-language-server'
brew 'mitmproxy'
brew 'mprocs'
brew 'neofetch'
brew 'nmap'
brew 'pass'
brew 'pinentry-mac'
brew 'portaudio'
brew 'proxychains-ng'
brew 'rtl-sdr'
brew 'rtx'
brew 'skhd'
brew 'soapyrtlsdr'
brew 'spotify-tui'
brew 'spotifyd'  
brew 'syncthing'
brew 'tailscale'
brew 'trash'
brew 'tree'
brew 'urh'
brew 'vifm'
brew 'volk'
brew 'wget'
brew 'xdg-ninja'
brew 'yabai'
brew 'ykman'
brew 'yubikey-personalization'
brew 'zoxide'
brew 'zstd'


# ---{ Casks } --------------------------------------------------------------------------
#
#   `brew cask` is an extension to `brew` that allows for the management of graphical
#   applications through the cask project
#

cask 'font-hack'
cask 'font-ia-writer-quattro'
cask 'font-iosevka'
cask 'font-iosevka-nerd-font'
cask 'font-jetbrains-mono'

cask 'appcleaner'
cask 'beardedspice'
cask 'blender'
cask 'burp-suite'
cask 'caffeine'
# cask 'calibre'
cask 'charles'
cask 'cyberduck'
cask 'discord'
cask 'dropbox'
cask 'element'
cask 'epic-games'
cask 'firefox'
cask 'freecad'
cask 'gpg-suite-no-mail'
cask 'hammerspoon'
cask 'hiddenbar'
cask 'hyperswitch'
cask 'inkscape'
cask 'itsycal'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'keka'
cask 'monitorcontrol'
cask 'obsidian'
cask 'openemu'
cask 'openscad'
cask 'rancher'
cask 'raycast'
cask 'react-native-debugger'
cask 'signal'
cask 'skim'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'tailscale'
cask 'thunderbird' 
cask 'transmission'
cask 'twitch'
cask 'ubersicht'
cask 'ultimaker-cura'
cask 'utm'
cask 'visual-studio-code'
cask 'vlc'
cask 'webex'
cask 'wezterm'
cask 'whatsapp'
cask 'wireshark'
cask 'xquartz'
cask 'zoom'

cask 'gqrx'
cask 'cubicsdr'

cask 'android-sdk'
cask 'temurin'

cask 'balenaetcher'
cask 'barrier'

# ---------------------------------------------------------------------------------------

# Other programs
# ---------------------------------------------------------------------------------------
# - 1password
# - keybase
# - yubico authenticator
# cask '1password-cli'

# ---------------------------------------------------------------------------------------
