# ---------------------------------------------------------------------------------------
# ---{ Brewfile } -----------------------------------------------------------------------
# ---------------------------------------------------------------------------------------
#
#   This file lists some of the programs that I use on mac OSX
#
#   `brew bundle cleanup`               Will tell you how out of sync this file is
#   `brew bundle cleanup --force`       Remove stuff that are not in this file
#   `brew bundle`                       Install everything listed in this file
#
# ---{ Taps } ---------------------------------------------------------------------------
#
#   These are the packages reposititories that homebrew should look at
#

cask_args appdir: '/Applications'
cask_args fontdir: '/Library/Fonts'

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'

tap 'clementtsang/bottom'

brew 'aria2'
brew 'bottom'
brew 'direnv'
brew 'gnu-getopt'
brew 'go'
brew 'tree'
brew 'helm@2'
brew 'jq'
brew 'mitmproxy'
brew 'nmap'
brew 'neovim'
brew 'node@12'
brew 'nvm'
brew 'rga'
brew 'ripgrep'
brew 'sops'
brew 'syncthing'
brew 'terraform'
brew 'tree'
brew 'yadm'
brew 'zplug'

cask 'font-hack'
cask 'font-jetbrains-mono'

# ---{ Casks } --------------------------------------------------------------------------
#
#   `brew cask` is an extension to `brew` that allows for the management of graphical
#   applications through the cask project
#

cask 'alfred'
cask 'appcleaner'
cask 'beardedspice'
cask 'caffeine'
cask 'charles'
cask 'cyberduck'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'flycut'
cask 'insomnia'
cask 'itsycal'
cask 'hiddenbar'
cask 'hyperswitch'
cask 'jetbrains-toolbox'
cask 'keybase'
cask 'kite'
cask 'kitty'
cask 'postman'
cask 'spotify'
cask 'sublime-text'
cask 'sublime-merge'
cask 'ubersicht'
cask 'visual-studio-code'

# ---------------------------------------------------------------------------------------
